<?php defined('SYSPATH') or die('No direct access allowed.');

return array(
	
    'akkaunt'                       => 'акаунт',
    'akkaunt.not_empty'				=> 'введите ваш аккаунт',
    'phone'                         => 'Телефон',
    'phone.not_empty'				=> 'введите ваш номер телефона',
    'phone.notice'					=> 'номер телефона вводить в формате +79271234567',
    
    'summa'                         => 'Сумма($)',
    'summa.allow_uot'               => 'Сумма больше чем есть на вашем счету',
    'summa.not_empty'				=> 'введите сумму',
    'summa.decimal'			      	=> 'сумма должна быть числом',
    'summa.decimal'			      	=> 'сумма должна быть числом',
    'summa.allow'		 	    	=> 'введите сумму более 50',
    
    'create.13'			      	=> 'Сервер занят, повторите запрос позже',
    'create.150'			    => 'Ошибка авторизации (неверный логин/пароль)',
    'create.210'			      	=> 'Счет не найден',
    'create.215'			      	=> 'Счет с таким txn уже существует',
    'create.241'			      	=> 'Сумма слишком мала',
    'create.242'			      	=> 'Превышена максимальная сумма платежа – 15 000р.',
    'create.278'			      	=> 'Превышение максимального интервала получения списка счетов',
    'create.298'			      	=> 'Агента не существует в системе',
    'create.300'			      	=> 'Неизвестная ошибка',
    'create.330'			      	=> 'Ошибка шифрования',
    'create.370'			      	=> 'Превышено максимальное кол-во одновременно выполняемых запросов',
);
